[
    {
        "id": "1",
        "title" : "Computer Technology Course",
        "thumbnail_url": "https://www.avocor.com/wp-content/uploads/2018/07/Avocor-Future-Trends-2.jpg",
        "image_url": "https://www.avocor.com/wp-content/uploads/2018/07/Avocor-Future-Trends-2.jpg",
        "details": "A computer engineer, equipped with a broad background in electrical engineering and computer science, will be entering an exciting and rapidly growing profession with unlimited opportunities in industry, government, and education. Many of our students have already participated in that world through internships. Some examples of internship placements are: Engineering Intern, AT&T Computer; Engineering Intern, IBM Corporation; Computer Engineering Intern, Computer Science Corporation; Computer Science Engineer Intern, Intel Corporation; and Engineering Technician, Mitre Corporation. Computer Engineering graduates are equipped for careers as engineers, electrical designers, electrical engineers, design and applications engineers, test engineers, power systems engineers, and product engineers."
      },
    {
        "id": "2",
        "title" : "Civil Engineering Course",
        "thumbnail_url": "https://www.senecacollege.ca/content/dam/projects/seneca/Program-2018/cvt_top.jpg",
        "image_url": "https://www.senecacollege.ca/content/dam/projects/seneca/Program-2018/cvt_top.jpg",
        "details": "Civil engineers design, create and connect up the world around us. They help make our villages, towns and cities work for the people that live there. Have a look at all our civil engineering projects and see for yourself the work that civil engineers do. Includes our ICE 200 projects. It's about roads and railways, schools, offices, hospitals, water and power supply and much more. The kinds of things we take for granted but would find life very hard to live without. Civil engineer' covers a huge range of jobs and all types of engineering. Civil engineers come from all different backgrounds but they all spend years training, learning and getting qualifications. Why not hear what civil engineers have to say about their work?"
      },
    {
        "id": "3",
        "title" : "Electrical Engineering Course",
        "thumbnail_url": "https://www.electricalengineeringinfo.com/wp-content/uploads/2022/06/Electricity-and-lighting-Copy-1024x735.jpg",
        "image_url": "https://www.electricalengineeringinfo.com/wp-content/uploads/2022/06/Electricity-and-lighting-Copy-1024x735.jpg",
        "details": "the branch of engineering concerned with the practical applications of electricity in all its forms, including those of the field of electronics. Electronics engineering is that branch of electrical engineering concerned with the uses of the electromagnetic spectrum and with the application of such electronic devices as integrated circuits and transistors.In engineering practice, the distinction between electrical engineering and electronics is usually based on the comparative strength of the electric currents used. In this sense, electrical engineering is the branch dealing with “heavy current”—that is, electric light and power systems and apparatuses—whereas electronics engineering deals with such “light current” applications as telephone and radio communication, computers, radar, and automatic control systems.The distinction between the fields has become less sharp with technical progress. For example, in the high-voltage transmission of electric power, large arrays of electronic devices are used to convert transmission-line current at power levels in the tens of megawatts. Moreover, in the regulation and control of interconnected power systems, electronic computers are used to compute requirements much more rapidly and accurately than is possible by manual methods."
      },
    {
        "id": "4",
        "title" : "Architecture Engineering Course",
        "thumbnail_url": "https://bubt.edu.bd/assets/frontend/slider_image/slider_1.jpeg",
        "image_url": "https://bubt.edu.bd/assets/frontend/slider_image/slider_1.jpeg",
        "details": "Architectural engineers apply practical and theoretical knowledge to the engineering design of buildings and building systems. The goal is to engineer high-performance buildings that are sustainable, resilient, economically viable, that ensure the safety, health, comfort, and productivity of occupants. Uniting scientific principles from structural, mechanical, electrical, lighting, acoustical, and construction engineering, architectural engineers apply their discipline-specific expertise to conceptualize, design, construct, operate and maintain built environments in interdisciplinary team environments.Graduates of architectural engineering are widely considered to be creative systems engineers, with formal training in creativity and design through architectural design studios married with a solid engineering education.Architectural engineers have a lasting impact on society. Because people spend 86% of their time in indoors, architectural engineers concentrate on indoor building environments that prioritize the human condition and well-being of society. They also promote sustainable practices by lowering energy consumption and occupants’ carbon footprint, so much so that architectural engineering has been identified as the discipline with the highest potential to combat climate change."
      },
    {
        "id": "5",
        "title" : "Mechanical Engineering Course",
        "thumbnail_url": "https://www.aeccglobal.com.np/images/easyblog_articles/187/b2ap3_large_study-mechanical-engineering-overseas.webp",
        "image_url": "https://www.aeccglobal.com.np/images/easyblog_articles/187/b2ap3_large_study-mechanical-engineering-overseas.webp",
        "details": "Simply speaking, mechanical engineering deals with understanding how things work, from the tiniest micro-particle to the largest spacecraft, and even the human body—one of our most complex machines. It is the broadest of all engineering disciplines, and interdisciplinary work is key to our department’s success. Mechanical engineers are at the center of technological and environmental advancements and work broadly in mechanical, environmental and material-based problems. Mechanical engineers design and create everything from microsensors, medical devices, computers and car engines to robots, cookstoves, sports equipment and airplanes. Mechanical engineers seek new knowledge through research, creative design and development, and with the construction, control, management and sales of the devices and systems needed by society. Mechanical engineers ask: Mechanical engineering is one of UW's largest and most popular engineering departments. We draw talented and creative students and offer a world-class education with an incredible breadth of skill and technological training. Our graduates are making a difference in diverse sectors such as biotechnology and health, environmental engineering and energy, transportation, manufacturing and information systems."
      },
    {
        "id": "6",
        "title" : "Electronics Engineering Course",
        "thumbnail_url": "https://umanitoba.ca/engineering/sites/engineering/files/styles/3x2_900w/public/2021-02/bachelor-science-electrical-engineering.jpg?itok=MYUF5YMP",
        "image_url": "https://umanitoba.ca/engineering/sites/engineering/files/styles/3x2_900w/public/2021-02/bachelor-science-electrical-engineering.jpg?itok=MYUF5YMP",
        "details": "Electronic engineering, or electronics engineering is a form of engineering associated with electronic circuits, devices and the equipment and systems that use them. very many people have careers in electronic engineering and find their jobs absorbing, interesting and they provide an interesting challenge that ensure Electronic engineering is all about creativity. The whole area of engineering is about designing, making, running, and servicing things that people need. Electronic engineering can be a particularly rewarding career: electronics engineering covers a broad spectrum of areas, all under the same banner, and this allows anyone considering a career to chose the one they want. It is also possible to move from one area to another, and this guarantees most people a rewarding career for life. With the complexity of many logic / digitally based circuits, an approach that is being used increasingly is one where programmable logic chips are used. FPGAs, and other programmable logic chips are widely used, enabling large amounts of logic to be incorporated into programmable chips. Using high levels design languages like VHDL, etc, the design is brought to within manageable limits. Also if the design needs optimising or changing, this can be achieved by changing the logic programme. This sector of the electronic engineering arena is growing, and the tools becoming more sophisticated and very interesting to use. It can provide a very interesting and stimulating career, and t may often be linked with soem digital design for the external circuitry."
      }
      
]